In [6]:
import numpy as np
import pandas as pd
import re
from sklearn.metrics import accuracy_score
from sklearn import preprocessing
from sklearn.model_selection import train_test_split
from sklearn import linear_model

In [7]:
#Import Data
#Download Data from https://www.kaggle.com/c/titanic/data
df = pd.read_csv("train.csv")
df.sample(7)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
599,600,1,1,"Duff Gordon, Sir. Cosmo Edmund (""Mr Morgan"")",male,49.0,1,0,PC 17485,56.9292,A20,C
320,321,0,3,"Dennis, Mr. Samuel",male,22.0,0,0,A/5 21172,7.2500,NaN,S
226,227,1,2,"Mellors, Mr. William John",male,19.0,0,0,SW/PP 751,10.5000,NaN,S
665,666,0,2,"Hickman, Mr. Lewis",male,32.0,2,0,S.O.C. 14879,73.5000,NaN,S
424,425,0,3,"Rosblom, Mr. Viktor Richard",male,18.0,1,1,370129,20.2125,NaN,S
766,767,0,1,"Brewe, Dr. Arthur Jackson",male,NaN,0,0,112379,39.6000,NaN,C
270,271,0,1,"Cairns, Mr. Alexander",male,NaN,0,0,113798,31.0000,NaN,S

In [8]:
df['Age'] = df['Age'].replace(np.nan, df['Age'].mean(), regex=True)
df['Embarked'] = df['Embarked'].replace(np.nan, "M", regex=True)

In [9]:
names = df['Name']
titles = []

for i in range(len(names)):
	s = names[i]
	title = re.search(', (.*)\.', s)
	title = title.group(1)
	titles.append(title)

df['Titles'] = titles

In [10]:
df.sample(7)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Titles
77,78,0,3,"Moutal, Mr. Rahamin Haim",male,29.699118,0,0,374746,8.0500,NaN,S,Mr
487,488,0,1,"Kent, Mr. Edward Austin",male,58.000000,0,0,11771,29.7000,B37,C,Mr
733,734,0,2,"Berriman, Mr. William John",male,23.000000,0,0,28425,13.0000,NaN,S,Mr
591,592,1,1,"Stephenson, Mrs. Walter Bertram (Martha Eustis)",female,52.000000,1,0,36947,78.2667,D20,C,Mrs
391,392,1,3,"Jansson, Mr. Carl Olof",male,21.000000,0,0,350034,7.7958,NaN,S,Mr
123,124,1,2,"Webber, Miss. Susan",female,32.500000,0,0,27267,13.0000,E101,S,Miss
774,775,1,2,"Hocking, Mrs. Elizabeth (Eliza Needs)",female,54.000000,1,3,29105,23.0000,NaN,S,Mrs

In [11]:
df = df.drop(['PassengerId'], axis=1)
df = df.drop(['Name'], axis=1)
df = df.drop(['Cabin'], axis=1)

In [12]:
df.sample(7)

,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Titles
134,0,2,male,25.000000,0,0,C.A. 29178,13.0000,S,Mr
607,1,1,male,27.000000,0,0,113804,30.5000,S,Mr
358,1,3,female,29.699118,0,0,330931,7.8792,Q,Miss
668,0,3,male,43.000000,0,0,A/5 3536,8.0500,S,Mr
488,0,3,male,30.000000,0,0,A.5. 18509,8.0500,S,Mr
397,0,2,male,46.000000,0,0,28403,26.0000,S,Mr
369,1,1,female,24.000000,0,0,PC 17477,69.3000,C,Mme

In [13]:
lb1 = preprocessing.LabelBinarizer()
lb2 = preprocessing.LabelBinarizer()
lb3 = preprocessing.LabelBinarizer()
lb4 = preprocessing.LabelBinarizer()

In [14]:
Sex_C = lb1.fit_transform(df.Sex)
Ticket_C = lb2.fit_transform(df.Ticket)
Embarked_C = lb3.fit_transform(df.Embarked)
Titles_C = lb4.fit_transform(df.Titles)

In [15]:
Sex_C[:10]

array([[1],
       [0],
       [0],
       [0],
       [1],
       [1],
       [1],
       [1],
       [0],
       [0]])

In [16]:
Ticket_C[:10]

array([[0, 0, 0, ..., 0, 0, 0],
       [0, 0, 0, ..., 0, 0, 0],
       [0, 0, 0, ..., 0, 0, 0],
       ...,
       [0, 0, 0, ..., 0, 0, 0],
       [0, 0, 0, ..., 0, 0, 0],
       [0, 0, 0, ..., 0, 0, 0]])

In [17]:
Embarked_C[:10]

array([[0, 0, 0, 1],
       [1, 0, 0, 0],
       [0, 0, 0, 1],
       [0, 0, 0, 1],
       [0, 0, 0, 1],
       [0, 0, 1, 0],
       [0, 0, 0, 1],
       [0, 0, 0, 1],
       [0, 0, 0, 1],
       [1, 0, 0, 0]])

In [18]:
Titles_C[:10]

array([[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0],
       [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0],
       [0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0],
       [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0],
       [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0],
       [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0],
       [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0],
       [0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
       [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0],
       [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0]])

In [19]:
Sex_C = pd.DataFrame(Sex_C, columns=["col_val:S"])

In [20]:
Sex_C.sample(5)

     col_val:S
207          1
3            0
210          1
225          1
634          0

In [21]:
Ticket_C = pd.DataFrame(Ticket_C, columns=['col_val:' + x for x in lb2.classes_])
Ticket_C = Ticket_C.iloc[:, 0:-1]

In [22]:
Ticket_C.sample(5)

,col_val:110152,col_val:110413,col_val:110465,col_val:110564,col_val:110813,col_val:111240,col_val:111320,col_val:111361,col_val:111369,col_val:111426,...,col_val:STON/O2. 3101283,col_val:STON/O2. 3101290,col_val:SW/PP 751,col_val:W./C. 14258,col_val:W./C. 14263,col_val:W./C. 6607,col_val:W./C. 6608,col_val:W./C. 6609,col_val:W.E.P. 5734,col_val:W/C 14208
198,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
886,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
711,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
261,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
618,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [23]:
Embarked_C = pd.DataFrame(Embarked_C, columns=['col_val:' + x for x in lb3.classes_])
Embarked_C = Embarked_C.iloc[:, 0:-1]

In [24]:
Embarked_C.sample(5)

     col_val:C  col_val:M  col_val:Q
298          0          0          0
729          0          0          0
818          0          0          0
156          0          0          1
381          1          0          0

In [25]:
Titles_C = pd.DataFrame(Titles_C, columns=['col_val:' + x for x in lb4.classes_])
Titles_C = Titles_C.iloc[:, 0:-1]

In [26]:
Titles_C.sample(5)

,col_val:Capt,col_val:Col,col_val:Don,col_val:Dr,col_val:Jonkheer,col_val:Lady,col_val:Major,col_val:Master,col_val:Miss,col_val:Mlle,col_val:Mme,col_val:Mr,col_val:Mrs,col_val:Mrs. Martin (Elizabeth L,col_val:Ms,col_val:Rev,col_val:Sir
229,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0
858,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0
451,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0
246,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0
695,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0

In [27]:
df_new = pd.concat([Sex_C, Ticket_C, Embarked_C, Titles_C], axis = 1)

In [28]:
df_new.sample(5)

,col_val:S,col_val:110152,col_val:110413,col_val:110465,col_val:110564,col_val:110813,col_val:111240,col_val:111320,col_val:111361,col_val:111369,...,col_val:Master,col_val:Miss,col_val:Mlle,col_val:Mme,col_val:Mr,col_val:Mrs,col_val:Mrs. Martin (Elizabeth L,col_val:Ms,col_val:Rev,col_val:Sir
702,0,0,0,0,0,0,0,0,0,0,...,0,1,0,0,0,0,0,0,0,0
466,1,0,0,0,0,0,0,0,0,0,...,0,0,0,0,1,0,0,0,0,0
78,1,0,0,0,0,0,0,0,0,0,...,1,0,0,0,0,0,0,0,0,0
221,1,0,0,0,0,0,0,0,0,0,...,0,0,0,0,1,0,0,0,0,0
20,1,0,0,0,0,0,0,0,0,0,...,0,0,0,0,1,0,0,0,0,0

In [29]:
df_new['Survived'] = df.Survived
df_new['Pclass'] = df.Pclass
df_new['Age'] = df.Age
df_new['SibSp'] = df.SibSp
df_new['Parch'] = df.Parch
df_new['Fare'] = df.Fare

In [30]:
df_new.sample(5)

,col_val:S,col_val:110152,col_val:110413,col_val:110465,col_val:110564,col_val:110813,col_val:111240,col_val:111320,col_val:111361,col_val:111369,...,col_val:Mrs. Martin (Elizabeth L,col_val:Ms,col_val:Rev,col_val:Sir,Survived,Pclass,Age,SibSp,Parch,Fare
676,1,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,3,24.500000,0,0,8.0500
300,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,1,3,29.699118,0,0,7.7500
484,1,0,0,0,0,0,0,0,0,0,...,0,0,0,0,1,1,25.000000,1,0,91.0792
802,1,0,0,0,0,0,0,0,0,0,...,0,0,0,0,1,1,11.000000,1,2,120.0000
103,1,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,3,33.000000,0,0,8.6542

In [31]:
df_x = df_new.drop(['Survived'], axis = 1)
df_y = df_new[['Survived']]

In [32]:
x_train, x_test, y_train, y_test = train_test_split(df_x, df_y, test_size = 0.15, random_state = 10)

In [33]:
clf = linear_model.LogisticRegression()
clf = clf.fit(x_train, y_train.values.ravel())

a = clf.predict(x_test)

In [34]:
accuracy_score(y_test, a)

0.88059701492537312